In [1]:
import pandas as pd

dict={'Names':['Ram','suresh','Suresh','Ramesh','Mohit','sonali','reena','soniya'], 
      'Marks':[56,57,58,59,60,61,62,63],
      'Gender':['male','male','male','male','male','female','female','female']
     }

df1=pd.DataFrame(dict)
df1

    Names  Marks  Gender
0     Ram     56    male
1  suresh     57    male
2  Suresh     58    male
3  Ramesh     59    male
4   Mohit     60    male
5  sonali     61  female
6   reena     62  female
7  soniya     63  female

# 1.Display Top3 Rows in Dataset

In [2]:
#by default head give five rows
df1.head()

# top three rows
#df1.head(3)

    Names  Marks Gender
0     Ram     56   male
1  suresh     57   male
2  Suresh     58   male
3  Ramesh     59   male
4   Mohit     60   male

# 2.Check last 3 rows of the Dataset

In [3]:
df1.tail()

    Names  Marks  Gender
3  Ramesh     59    male
4   Mohit     60    male
5  sonali     61  female
6   reena     62  female
7  soniya     63  female

# 3.find Shape of our DataSet(Number of Rows &Number of Colums)

In [35]:
#df1.shape
#print('Number of Rows',df1.shape[0])
print('number of columns',df1.shape[1])

number of columns 5

# 4.GET INFORMATION ABOUT OUR DATASET LIKE TOTAL NUMBER ROWS,TOTAL NUMBER OF COLUMNS,DATATYPES OF EACH COLUMN AND MEMORY REQUIRED

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   8 non-null      object
 1   Marks   8 non-null      int64
 2   Gender  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes

# 5.CHECK NULL VALUES IN THE DATASET

In [12]:
df1.isnull()
#df1.isnull().sum(axis=1)

   Names  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False
7  False  False   False

# GET OVERALL STATISTICS ABOUT DATAFRAME

In [41]:
df1.describe()
#df1.describe(include='all')

          Marks  half_marks  male_female
count   8.00000    8.000000     8.000000
mean   59.50000   29.750000     0.625000
std     2.44949    1.224745     0.517549
min    56.00000   28.000000     0.000000
25%    57.75000   28.875000     0.000000
50%    59.50000   29.750000     1.000000
75%    61.25000   30.625000     1.000000
max    63.00000   31.500000     1.000000

# FIND UNIQUE VALUES FROM GENDER COLUMN

In [4]:
import pandas as pd

dict={'Names':['Ram','suresh','Suresh','Ramesh','Mohit','sonali','reena','soniya'], 
      'Marks':[56,57,58,59,60,61,62,63],
      'Gender':['male','male','male','male','male','female','female','female']
     }

df1=pd.DataFrame(dict)
df1['Gender'].unique()

array(['male', 'female'], dtype=object)

# FIND THE NUMBER OF UNIQUE VALES FROM THE GENDER COLUMN

In [5]:
df1['Gender'].nunique()

2

# DISPLAY COUNT OF UNIQUE VALUES IN GENDER COLUMN

In [6]:
df1['Gender'].value_counts()

Gender
male      5
female    3
Name: count, dtype: int64

# FIND TOTAL NUMBER OF STUDENT HAVING MARKS BETWEEN 90 TO 100(INCLUSIVE)USING BETWEEN METHOD

In [50]:
#df1[df1['Marks']>40]
#len(df1[(df1['Marks']>=50) & (df1['Marks']<=60)])
sum(df1['Marks'].between(50,60))

5

# FIND AVERGE MARKS

In [51]:
#df1['Marks'].max()
df1['Marks'].mean()
#df1['Marks'].min()

59.5

# APPLY METHOD

In [32]:
def marks(x) :
   return x/2

df1['half_marks']=df1['Marks'].apply(marks)
df1

df1['half_marks']=df1['Marks'].apply(lambda x: x/2) 
df1

    Names  Marks  Gender  half_marks
0     Ram     56    male        28.0
1  suresh     57    male        28.5
2  Suresh     58    male        29.0
3  Ramesh     59    male        29.5
4   Mohit     60    male        30.0
5  sonali     61  female        30.5
6   reena     62  female        31.0
7  soniya     63  female        31.5

# MAP FUNCTION

In [33]:
df1['Names'].apply(len)
#covert male =1 female 0
df1['male_female']=df1['Gender'].map({'male':1,'female':0})
df1

    Names  Marks  Gender  half_marks  male_female
0     Ram     56    male        28.0            1
1  suresh     57    male        28.5            1
2  Suresh     58    male        29.0            1
3  Ramesh     59    male        29.5            1
4   Mohit     60    male        30.0            1
5  sonali     61  female        30.5            0
6   reena     62  female        31.0            0
7  soniya     63  female        31.5            0

# DROP COLUMN

In [34]:
df1.drop('male_female',axis=1)
df1.drop(['male_female','half_marks'],axis=1)

    Names  Marks  Gender
0     Ram     56    male
1  suresh     57    male
2  Suresh     58    male
3  Ramesh     59    male
4   Mohit     60    male
5  sonali     61  female
6   reena     62  female
7  soniya     63  female

# PRINT NAME OF COLOUM

In [ ]:
df1.columns
df1.index

# SORT THE DATAFRAME AS PER THE MARKS COLUMN

In [ ]:
df1.sort_values(by='Marks',ascending=False)

# DISPLAY NAME & MARKS OF THE FEMALE STUDENT

In [ ]:
df1[df1['Gender']=='female'][['Names','Marks']]

df1[df1['Gender'].isin(['female'])][['Names','Marks']]